<a href="https://colab.research.google.com/github/bkrant/DS-Unit-1-Sprint-2-Data-Wrangling/blob/master/DS_Unit_1_Sprint_Challenge_2_Data_Wrangling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Science Unit 1 Sprint Challenge 2

## Data Wrangling

In this Sprint Challenge you will use data from [Gapminder](https://www.gapminder.org/about-gapminder/), a Swedish non-profit co-founded by Hans Rosling. "Gapminder produces free teaching resources making the world understandable based on reliable statistics."
- [Cell phones (total), by country and year](https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--cell_phones_total--by--geo--time.csv)
- [Population (total), by country and year](https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--population_total--by--geo--time.csv)
- [Geo country codes](https://github.com/open-numbers/ddf--gapminder--systema_globalis/blob/master/ddf--entities--geo--country.csv)

These two links have everything you need to successfully complete the Sprint Challenge!
- [Pandas documentation: Working with Text Data](https://pandas.pydata.org/pandas-docs/stable/text.html) (one question)
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf) (everything else)

## Part 0. Load data

You don't need to add or change anything here. Just run this cell and it loads the data for you, into three dataframes.

In [0]:
import pandas as pd

cell_phones = pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--cell_phones_total--by--geo--time.csv')

population = pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--population_total--by--geo--time.csv')

geo_country_codes = (pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--entities--geo--country.csv')
                       .rename(columns={'country': 'geo', 'name': 'country'}))

## Part 1. Join data

First, join the `cell_phones` and `population` dataframes (with an inner join on `geo` and `time`).

The resulting dataframe's shape should be: (8590, 4)

In [5]:
print(population.shape)
population.head(2)

(59297, 3)

   geo  time  population_total
0  afg  1800           3280000
1  afg  1801           3280000

In [6]:
print(cell_phones.shape)
cell_phones.head(2)

(9215, 3)

   geo  time  cell_phones_total
0  abw  1960                0.0
1  abw  1965                0.0

In [9]:
print(geo_country_codes.shape)
geo_country_codes.head(2)

(273, 33)

,geo,alt_5,alternative_1,alternative_2,alternative_3,alternative_4_cdiac,arb1,arb2,arb3,arb4,...,latitude,longitude,main_religion_2008,country,pandg,un_state,unicode_region_subtag,upper_case_name,world_4region,world_6region
0,abkh,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,Abkhazia,NaN,False,NaN,NaN,europe,europe_central_asia
1,abw,NaN,NaN,NaN,NaN,Aruba,NaN,NaN,NaN,NaN,...,12.5,-69.96667,christian,Aruba,NaN,False,AW,ARUBA,americas,america

In [0]:
merge1 = pd.merge(cell_phones, population, how='inner', on=['geo', 'time'])

In [10]:
print(merge1.shape)
merge1.head(2)

(8590, 4)

   geo  time  cell_phones_total  population_total
0  afg  1960                0.0           8996351
1  afg  1965                0.0           9938414

Then, select the `geo` and `country` columns from the `geo_country_codes` dataframe, and join with your population and cell phone data.

The resulting dataframe's shape should be: (8590, 5)

In [213]:
df = pd.merge(geo_country_codes[['geo', 'country']], merge1, on='geo', how='right')
print(df.shape)
df.head(2)

(8590, 5)

   geo      country  time  cell_phones_total  population_total
0  afg  Afghanistan  1960                0.0           8996351
1  afg  Afghanistan  1965                0.0           9938414

## Part 2. Make features

Calculate the number of cell phones per person, and add this column onto your dataframe.

(You've calculated correctly if you get 1.220 cell phones per person in the United States in 2017.)

In [0]:
df['cell/person'] = df['cell_phones_total']/df['population_total']

In [215]:
df.head(2)

   geo      country  time  cell_phones_total  population_total  cell/person
0  afg  Afghanistan  1960                0.0           8996351          0.0
1  afg  Afghanistan  1965                0.0           9938414          0.0

In [51]:
df.groupby(['country','time']).mean().unstack().head(2)

            cell_phones_total                                               \
time                     1960 1965 1970 1975 1976 1977 1978 1979 1980 1981
country
Afghanistan               0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
Albania                   0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0

               ...    cell/person                                          \
time           ...           2008      2009      2010      2011      2012
country        ...
Afghanistan    ...       0.289401  0.374942  0.354678  0.464441  0.499728
Albania        ...       0.621607  0.831605  0.915609  1.059228  1.198614


time             2013      2014      2015      2016      2017
country
Afghanistan  0.529665  0.561913  0.584205  0.623354  0.673506
Albania      1.262765  1.150261  1.163375  1.151523  1.193763

[2 rows x 138 columns]

In [49]:
df.groupby(['country','time']).mean().unstack()['cell/person'][2017]['United States']

1.2201246847283354

Modify the `geo` column to make the geo codes uppercase instead of lowercase.

In [216]:
df['geo'] = df['geo'].str.upper()
df['geo'].head()

0    AFG
1    AFG
2    AFG
3    AFG
4    AFG
Name: geo, dtype: object

## Part 3. Process data

Use the describe function, to describe your dataframe's numeric columns, and then its non-numeric columns.

(You'll see the time period ranges from 1960 to 2017, and there are 195 unique countries represented.)

In [54]:
df.describe()

              time  cell_phones_total  population_total  cell/person
count  8590.000000       8.590000e+03      8.590000e+03  8590.000000
mean   1994.193481       9.004950e+06      2.983823e+07     0.279639
std      14.257975       5.573408e+07      1.161284e+08     0.454247
min    1960.000000       0.000000e+00      4.433000e+03     0.000000
25%    1983.000000       0.000000e+00      1.456148e+06     0.000000
50%    1995.000000       6.200000e+03      5.725062e+06     0.001564
75%    2006.000000       1.697652e+06      1.810581e+07     0.461149
max    2017.000000       1.474097e+09      1.409517e+09     2.490243

In [57]:
df.describe(exclude='number')

         geo country
count   8590    8590
unique   195     195
top      IRN  Bhutan
freq      46      46

In 2017, what were the top 5 countries with the most cell phones total?

Your list of countries should have these totals:

| country | cell phones total |
|:-------:|:-----------------:|
|    ?    |     1,474,097,000 |
|    ?    |     1,168,902,277 |
|    ?    |       458,923,202 |
|    ?    |       395,881,000 |
|    ?    |       236,488,548 |

In [0]:
# This optional code formats float numbers with comma separators
pd.options.display.float_format = '{:,}'.format

In [169]:
df.dtypes

geo                   object
country               object
time                   int64
cell_phones_total    float64
population_total       int64
cell/person          float64
dtype: object

In [66]:
df.columns.tolist()

['geo',
 'country',
 'time',
 'cell_phones_total',
 'population_total',
 'cell/person']

In [119]:
df[df['time']==2017].groupby('country')['cell_phones_total'].sum().sort_values(ascending=False).head()

country
China           1,474,097,000.0
India           1,168,902,277.0
Indonesia         458,923,202.0
United States     395,881,000.0
Brazil            236,488,548.0
Name: cell_phones_total, dtype: float64

In [120]:
df[df['time']==2017].pivot_table(index='country',aggfunc=sum).sort_values('cell_phones_total', ascending=False)['cell_phones_total'].head()

country
China           1,474,097,000.0
India           1,168,902,277.0
Indonesia         458,923,202.0
United States     395,881,000.0
Brazil            236,488,548.0
Name: cell_phones_total, dtype: float64

2017 was the first year that China had more cell phones than people.

What was the first year that the USA had more cell phones than people?

In [0]:
us = df[df['country']=='United States'].pivot_table(index=['country','time'],aggfunc=sum)[['cell_phones_total','population_total']]

In [0]:
us['population_total'] = us['population_total'].astype(float)

In [225]:
us[:8]

                    cell_phones_total  population_total
country       time
United States 1960                0.0     186,808,228.0
              1965                0.0     199,815,540.0
              1970                0.0     209,588,150.0
              1975                0.0     219,205,296.0
              1976                0.0     221,239,215.0
              1977                0.0     223,324,042.0
              1978                0.0     225,449,657.0
              1979                0.0     227,599,878.0

In [228]:
for i in range(len(us)):
  if us.cell_phones_total[i] > us.population_total[i]:
    print(us.loc[(slice(None), [i+1975]), :])
    break

                    cell_phones_total  population_total
country       time
United States 2014      355,500,000.0     317,718,779.0

## Part 4. Reshape data

Create a pivot table:
- Columns: Years 2007—2017
- Rows: China, India, United States, Indonesia, Brazil (order doesn't matter)
- Values: Cell Phones Total

The table's shape should be: (5, 11)

In [159]:
df.head(2)

   geo      country  time  cell_phones_total  population_total  cell/person
0  AFG  Afghanistan  1960                0.0           8996351          0.0
1  AFG  Afghanistan  1965                0.0           9938414          0.0

In [165]:
df[ (df['time']>=2007) & (df['time']<=2017) ].pivot_table(index='time', columns='country', values='cell_phones_total')

country,Afghanistan,Albania,Algeria,Andorra,Angola,Antigua and Barbuda,Argentina,Armenia,Australia,Austria,...,United Kingdom,United States,Uruguay,Uzbekistan,Vanuatu,Venezuela,Vietnam,Yemen,Zambia,Zimbabwe
time,,,,,,,,,,,,,,,,,,,,,
2007,"4,668,096.0","2,322,436.0","27,562,721.0","63,503.0","4,961,536.0","112,381.0","40,401,771.0","1,876,411.0","21,260,000.0","9,912,000.0",...,"73,836,210.0","249,300,000.0","3,004,323.0","5,691,458.0","26,000.0","23,820,133.0","45,024,048.0","4,349,000.0","2,639,026.0","1,225,654.0"
2008,"7,898,909.0","1,859,632.0","27,031,472.0","64,202.0","6,773,356.0","136,592.0","46,508,774.0","1,442,000.0","22,120,000.0","10,816,000.0",...,"74,940,937.0","261,300,000.0","3,507,816.0","12,375,274.0","36,000.0","27,414,377.0","74,872,310.0","6,445,000.0","3,539,003.0","1,654,721.0"
2009,"10,500,000.0","2,463,741.0","32,729,824.0","64,549.0","8,109,421.0","134,925.0","52,482,780.0","2,191,500.0","22,200,000.0","11,434,000.0",...,"76,481,053.0","274,283,000.0","4,111,560.0","16,417,914.0","131,682.0","28,123,570.0","98,223,980.0","8,313,000.0","4,406,682.0","3,991,000.0"
2010,"10,215,840.0","2,692,372.0","32,780,165.0","65,495.0","9,403,365.0","167,970.0","57,082,298.0","3,865,354.0","22,500,000.0","12,241,000.0",...,"76,729,827.0","285,118,000.0","4,437,158.0","20,952,000.0","169,935.0","27,880,132.0","111,570,201.0","11,085,000.0","5,446,991.0","7,700,000.0"
2011,"13,797,879.0","3,100,000.0","35,615,926.0","65,044.0","12,073,218.0","176,008.0","60,722,729.0","3,211,215.0","23,789,000.0","13,022,578.0",...,"77,162,298.0","297,404,000.0","4,757,425.0","25,441,789.0","136,956.0","28,781,999.0","127,318,045.0","11,668,000.0","8,164,553.0","9,200,000.0"
2012,"15,340,115.0","3,500,000.0","37,527,703.0","63,865.0","12,785,109.0","127,381.0","64,327,647.0","3,322,837.0","24,338,000.0","13,588,000.0",...,"78,329,355.0","304,838,000.0","4,995,459.0","20,274,090.0","146,084.0","30,569,073.0","131,673,724.0","13,900,000.0","10,524,676.0","12,613,935.0"
2013,"16,807,156.0","3,685,983.0","39,517,045.0","63,931.0","13,285,198.0","114,358.0","67,361,515.0","3,346,275.0","24,940,000.0","13,272,000.0",...,"78,673,978.0","310,698,000.0","5,267,947.0","21,500,000.0","127,244.0","30,896,079.0","123,735,557.0","16,844,700.0","10,395,801.0","13,633,167.0"
2014,"18,407,168.0","3,359,654.0","43,298,174.0","66,241.0","14,052,558.0","120,041.0","61,234,216.0","3,459,137.0","25,060,000.0","12,952,605.0",...,"78,460,684.0","355,500,000.0","5,497,094.0","21,639,200.0","156,051.0","30,528,022.0","136,148,124.0","17,100,000.0","10,114,867.0","11,798,652.0"
2015,"19,709,038.0","3,400,955.0","43,227,643.0","71,336.0","13,884,532.0","176,000.0","61,842,011.0","3,464,490.0","25,770,000.0","13,470,623.0",...,"79,250,793.0","382,307,000.0","5,165,474.0","21,783,300.0","174,818.0","29,093,517.0","120,324,052.0","15,021,953.0","11,557,725.0","12,757,410.0"
2016,"21,602,982.0","3,369,756.0","47,041,321.0","76,132.0","13,001,124.0","180,000.0","63,723,692.0","3,434,567.0","26,551,000.0","14,270,000.0",...,"78,931,386.0","395,881,000.0","5,116,736.0","23,265,389.0","218,603.0","27,600,893.0","120,600,235.0","16,433,055.0","12,017,034.0","12,878,926.0"
2017,"23,929,713.0","3,497,950.0","49,873,389.0","80,337.0","13,323,952.0",nan,"61,897,379.0","3,488,524.0","27,553,000.0","14,924,340.0",...,"79,173,658.0","395,881,000.0","5,097,569.0","24,265,460.0","228,016.0","24,493,687.0","120,016,181.0",nan,"13,438,539.0","14,092,104.0"

#### OPTIONAL BONUS QUESTION!

Sort these 5 countries, by biggest increase in cell phones from 2007 to 2017.

Which country had 935,282,277 more cell phones in 2017 versus 2007?

If you have the time and curiosity, what other questions can you ask and answer with this data?